//分别移出数组键和值代码事例
//保留第五位

$my_array = $_POST['c'];  




$qp=array_values($my_array);

//把数组键名换成0开始



print_r($qp);




echo "<br>";

echo "<hr>";

echo "<br>";



echo "合并第五位";


unset($qp['0']);

//移出数组键和值

unset($qp['1']);


//移出数组键和值


unset($qp['2']);

//移出数组键和值


unset($qp['3']);


//移出数组键和值






print_r($qp);






$aa5=array("1"=>"1","2"=>"2","3"=>"3","4"=>"4","5"=>"5","6"=>"6","7"=>"7","8"=>"8","9"=>"9","10"=>"10","11"=>"11","12"=>"12","13"=>"13","14"=>"14","15"=>"15","16"=>"16","17"=>"17","18"=>"18","19"=>"19","20"=>"20","21"=>"21","22"=>"22","23"=>"23","24"=>"24","25"=>"25","26"=>"26","27"=>"27","28"=>"28","29"=>"29","30"=>"30","31"=>"31","32"=>"32","33"=>"33","34"=>"34","35"=>"35");





$result5=array_diff_assoc($aa5,$qp);





$y=count($str);//获取C数组长度


$xy=$x2-$y;  //减法计算




$b5=mt_rand($xy,$xy); //设定位数值




 $arr5=array_rand($result5,$b5);  

 //在勾选号码中随机




//$arr4=$_POST['c'];  


// 把c数组赋值给arr4



$h5e= array_merge($arr5,$qp); 

//合并arr5和arr4数组


sort($h5e);      //按照顺序排列数组

$he5join=join("+", $h5e);   


 //把数组转换成字符串
 
echo  $he5join;




echo "<br>";


//分别移出数组键和值代码事例
//保留第四位

$my_array = $_POST['c'];  




$qp=array_values($my_array);

//把数组键名换成0开始



//print_r($qp);


echo "<br>";

echo "合并第四位";


unset($qp['0']);

//移出数组键和值

unset($qp['1']);


//移出数组键和值


unset($qp['2']);

//移出数组键和值


unset($qp['4']);


//移出数组键和值



print_r($qp);




$aa4=array("1"=>"1","2"=>"2","3"=>"3","4"=>"4","5"=>"5","6"=>"6","7"=>"7","8"=>"8","9"=>"9","10"=>"10","11"=>"11","12"=>"12","13"=>"13","14"=>"14","15"=>"15","16"=>"16","17"=>"17","18"=>"18","19"=>"19","20"=>"20","21"=>"21","22"=>"22","23"=>"23","24"=>"24","25"=>"25","26"=>"26","27"=>"27","28"=>"28","29"=>"29","30"=>"30","31"=>"31","32"=>"32","33"=>"33","34"=>"34","35"=>"35");





$result4=array_diff_assoc($aa4,$qp);





$y=count($str);//获取C数组长度


$xy=$x2-$y;  //减法计算




$b4=mt_rand($xy,$xy); //设定位数值




 $arr4=array_rand($result4,$b4);  

 //在勾选号码中随机




//$arr4=$_POST['c'];  


// 把c数组赋值给arr4



$h4e= array_merge($arr4,$qp); 

//合并arr5和arr4数组


sort($h4e);      //按照顺序排列数组

$he4join=join("+", $h4e);   


 //把数组转换成字符串
 
echo  $he4join;





echo "<br>";


//分别移出数组键和值代码事例
//保留第三位

$my_array = $_POST['c'];  




$qp=array_values($my_array);

//把数组键名换成0开始



//print_r($qp);


echo "<br>";

echo "合并第三位";


unset($qp['0']);

//移出数组键和值

unset($qp['1']);


//移出数组键和值


unset($qp['3']);

//移出数组键和值


unset($qp['4']);


//移出数组键和值






print_r($qp);






$aa3=array("1"=>"1","2"=>"2","3"=>"3","4"=>"4","5"=>"5","6"=>"6","7"=>"7","8"=>"8","9"=>"9","10"=>"10","11"=>"11","12"=>"12","13"=>"13","14"=>"14","15"=>"15","16"=>"16","17"=>"17","18"=>"18","19"=>"19","20"=>"20","21"=>"21","22"=>"22","23"=>"23","24"=>"24","25"=>"25","26"=>"26","27"=>"27","28"=>"28","29"=>"29","30"=>"30","31"=>"31","32"=>"32","33"=>"33","34"=>"34","35"=>"35");





$result3=array_diff_assoc($aa5,$qp);





$y=count($str);//获取C数组长度


$xy=$x2-$y;  //减法计算




$b3=mt_rand($xy,$xy); //设定位数值




 $arr3=array_rand($result3,$b3);  

 //在勾选号码中随机




//$arr4=$_POST['c'];  


// 把c数组赋值给arr4



$h3e= array_merge($arr3,$qp); 

//合并arr5和arr4数组


sort($h3e);      //按照顺序排列数组

$he3join=join("+", $h3e);   


 //把数组转换成字符串
 
echo  $he3join;








echo "<br>";


//分别移出数组键和值代码事例
//保留第二位

$my_array = $_POST['c'];  




$qp=array_values($my_array);

//把数组键名换成0开始



//print_r($qp);


echo "<br>";

echo "合并第二位";


unset($qp['0']);

//移出数组键和值

unset($qp['2']);


//移出数组键和值


unset($qp['3']);

//移出数组键和值


unset($qp['4']);


//移出数组键和值






print_r($qp);






$aa2=array("1"=>"1","2"=>"2","3"=>"3","4"=>"4","5"=>"5","6"=>"6","7"=>"7","8"=>"8","9"=>"9","10"=>"10","11"=>"11","12"=>"12","13"=>"13","14"=>"14","15"=>"15","16"=>"16","17"=>"17","18"=>"18","19"=>"19","20"=>"20","21"=>"21","22"=>"22","23"=>"23","24"=>"24","25"=>"25","26"=>"26","27"=>"27","28"=>"28","29"=>"29","30"=>"30","31"=>"31","32"=>"32","33"=>"33","34"=>"34","35"=>"35");





$result2=array_diff_assoc($aa2,$qp);





$y=count($str);//获取C数组长度


$xy=$x2-$y;  //减法计算




$b2=mt_rand($xy,$xy); //设定位数值




 $arr2=array_rand($result2,$b2);  

 //在勾选号码中随机




//$arr4=$_POST['c'];  


// 把c数组赋值给arr4



$h2e= array_merge($arr2,$qp); 

//合并arr5和arr4数组


sort($h2e);      //按照顺序排列数组

$he2join=join("+", $h2e);   


 //把数组转换成字符串
 
echo  $he2join;








echo "<br>";


//分别移出数组键和值代码事例
//5

$my_array = $_POST['c'];  




$qp=array_values($my_array);

//把数组键名换成0开始



//print_r($qp);


echo "<br>";

echo "合并第一位";


unset($qp['1']);

//移出数组键和值

unset($qp['2']);


//移出数组键和值


unset($qp['3']);

//移出数组键和值


unset($qp['4']);


//移出数组键和值






print_r($qp);






$aa1=array("1"=>"1","2"=>"2","3"=>"3","4"=>"4","5"=>"5","6"=>"6","7"=>"7","8"=>"8","9"=>"9","10"=>"10","11"=>"11","12"=>"12","13"=>"13","14"=>"14","15"=>"15","16"=>"16","17"=>"17","18"=>"18","19"=>"19","20"=>"20","21"=>"21","22"=>"22","23"=>"23","24"=>"24","25"=>"25","26"=>"26","27"=>"27","28"=>"28","29"=>"29","30"=>"30","31"=>"31","32"=>"32","33"=>"33","34"=>"34","35"=>"35");





$result1=array_diff_assoc($aa1,$qp);





$y=count($str);//获取C数组长度


$xy=$x2-$y;  //减法计算




$b1=mt_rand($xy,$xy); //设定位数值




 $arr1=array_rand($result1,$b1);  

 //在勾选号码中随机




//$arr4=$_POST['c'];  


// 把c数组赋值给arr4



$h1e= array_merge($arr1,$qp); 

//合并arr5和arr4数组


sort($h1e);      //按照顺序排列数组

$he1join=join("+", $h1e);   


 //把数组转换成字符串
 
echo  $he1join;


//输出结果集

echo "<br>";

echo "<br>";




























































































































































































